-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Час створення: Вер 30 2020 р., 18:37
-- Версія сервера: 10.4.10-MariaDB
-- Версія PHP: 7.3.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `covid`
--

-- --------------------------------------------------------

--
-- Структура таблиці `area`
--

DROP TABLE IF EXISTS `area`;
CREATE TABLE IF NOT EXISTS `area` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `region` varchar(255) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `lat` float NOT NULL,
  `lng` float NOT NULL,
  `radius` int(11) NOT NULL,
  `color` varchar(255) COLLATE utf8_unicode_ci NOT NULL DEFAULT 'ff0000',
  `probability` int(11) NOT NULL DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп даних таблиці `area`
--

INSERT INTO `area` (`id`, `title`, `region`, `lat`, `lng`, `radius`, `color`, `probability`) VALUES
(1, 'привіт', 'A1', 48.92, 24.71, 500, 'ff0000', 0),
(3, 'stometrivka', 'A1', 48.92, 24.71, 300, 'ff0000', 0),
(4, 'stometrivka', 'A1', 48.94, 24.72, 300, 'ff0000', 0);

-- --------------------------------------------------------

--
-- Структура таблиці `sanitizer`
--

DROP TABLE IF EXISTS `sanitizer`;
CREATE TABLE IF NOT EXISTS `sanitizer` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `lat` float NOT NULL,
  `lng` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп даних таблиці `sanitizer`
--

INSERT INTO `sanitizer` (`id`, `title`, `lat`, `lng`) VALUES
(1, 'цоі', 48.92, 24.71),
(2, 'стометрівка', 48.92, 24.7);

-- --------------------------------------------------------

--
-- Структура таблиці `setting`
--

DROP TABLE IF EXISTS `setting`;
CREATE TABLE IF NOT EXISTS `setting` (
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `value` text COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп даних таблиці `setting`
--

INSERT INTO `setting` (`name`, `value`) VALUES
('green', '<h3>Зелена зона</h3>\r\n<Typography component={\'div\'}>Заборонено:\r\n<ul>\r\n<li>робота громадського транспорту;</li>\r\n<li>відвідування освітніх установ;</li>\r\n<li>робота ТРЦ, кафе і ресторанів.</li>\r\n<li>посадка в міжобласний транспорт (висадка дозволена)</li>\r\n</ul>\r\n</Typography>\r\n'),
('orange', '<h3>Помаранчева зона</h3>\r\n<Typography component={\'div\'}>Заборонено:\r\n<ul>\r\n<li>робота громадського транспорту;</li>\r\n<li>відвідування освітніх установ;</li>\r\n<li>робота ТРЦ, кафе і ресторанів.</li>\r\n<li>посадка в міжобласний транспорт (висадка дозволена)</li>\r\n</ul>\r\n</Typography>\r\n'),
('red', '<h3>Червона зона</h3>\r\n<Typography component={\'div\'}>Заборонено:\r\n<ul>\r\n<li>робота громадського транспорту;</li>\r\n<li>відвідування освітніх установ;</li>\r\n<li>робота ТРЦ, кафе і ресторанів.</li>\r\n<li>посадка в міжобласний транспорт (висадка дозволена)</li>\r\n</ul>\r\n</Typography>\r\n'),
('status_id', '2'),
('yellow', '<h3>Жовта зона</h3>\r\n<Typography component={\'div\'}>Заборонено:\r\n<ul>\r\n<li>робота громадського транспорту;</li>\r\n<li>відвідування освітніх установ;</li>\r\n<li>робота ТРЦ, кафе і ресторанів.</li>\r\n<li>посадка в міжобласний транспорт (висадка дозволена)</li>\r\n</ul>\r\n</Typography>\r\n');

-- --------------------------------------------------------

--
-- Структура таблиці `stats`
--

DROP TABLE IF EXISTS `stats`;
CREATE TABLE IF NOT EXISTS `stats` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL,
  `cases` int(11) NOT NULL,
  `deaths` int(11) NOT NULL,
  `recovered` int(11) NOT NULL,
  `is_projection` tinyint(4) NOT NULL DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=100 DEFAULT CHARSET=latin1;

--
-- Дамп даних таблиці `stats`
--

INSERT INTO `stats` (`id`, `date`, `cases`, `deaths`, `recovered`, `is_projection`) VALUES
(1, '2020-07-08', 1, 0, 0, 0),
(2, '2020-07-09', 1, 0, 0, 0),
(3, '2020-07-10', 1, 0, 0, 0),
(4, '2020-07-11', 1, 0, 0, 0),
(5, '2020-07-12', 1, 0, 0, 0),
(6, '2020-07-13', 2, 0, 0, 0),
(7, '2020-07-14', 2, 0, 0, 0),
(8, '2020-07-15', 2, 0, 0, 0),
(9, '2020-07-16', 2, 0, 0, 0),
(10, '2020-07-17', 1, 0, 0, 0),
(11, '2020-07-18', 2, 0, 0, 0),
(12, '2020-07-19', 2, 0, 0, 0),
(13, '2020-07-20', 1, 0, 0, 0),
(14, '2020-07-21', 2, 0, 0, 0),
(15, '2020-07-22', 3, 0, 0, 0),
(16, '2020-07-23', 2, 0, 0, 0),
(17, '2020-07-24', 3, 0, 0, 0),
(18, '2020-07-25', 4, 0, 0, 0),
(19, '2020-07-26', 6, 0, 0, 0),
(20, '2020-07-27', 10, 0, 0, 0),
(21, '2020-07-28', 12, 0, 0, 0),
(22, '2020-07-29', 16, 0, 1, 0),
(23, '2020-07-30', 21, 0, 0, 0),
(24, '2020-07-31', 31, 0, 1, 0),
(25, '2020-08-01', 37, 0, 1, 0),
(26, '2020-08-02', 48, 1, 1, 0),
(27, '2020-08-03', 54, 1, 1, 0),
(28, '2020-08-04', 59, 1, 1, 0),
(29, '2020-08-05', 86, 1, 2, 0),
(30, '2020-08-06', 109, 1, 3, 0),
(31, '2020-08-07', 124, 2, 3, 0),
(32, '2020-08-08', 152, 2, 3, 0),
(33, '2020-08-09', 190, 2, 4, 0),
(34, '2020-08-10', 210, 2, 5, 0),
(35, '2020-08-11', 249, 3, 6, 0),
(36, '2020-08-12', 320, 3, 5, 0),
(37, '2020-08-13', 379, 4, 7, 0),
(38, '2020-08-14', 464, 5, 9, 0),
(39, '2020-08-15', 573, 6, 15, 0),
(40, '2020-08-16', 674, 7, 14, 0),
(41, '2020-08-17', 824, 8, 18, 0),
(42, '2020-08-18', 1012, 11, 23, 0),
(43, '2020-08-19', 1213, 13, 25, 0),
(44, '2020-08-20', 1465, 16, 30, 0),
(45, '2020-08-21', 1755, 18, 35, 0),
(46, '2020-08-22', 2166, 23, 44, 0),
(47, '2020-08-23', 2664, 28, 56, 0),
(48, '2020-08-24', 3211, 34, 67, 0),
(49, '2020-08-25', 3928, 42, 85, 0),
(50, '2020-08-26', 4837, 52, 106, 0),
(51, '2020-08-27', 5921, 61, 124, 0),
(52, '2020-08-28', 7245, 76, 150, 0),
(53, '2020-08-29', 8802, 93, 180, 0),
(54, '2020-08-30', 10675, 113, 227, 0),
(55, '2020-08-31', 12920, 129, 271, 0),
(56, '2020-09-01', 15594, 164, 327, 0),
(57, '2020-09-02', 18905, 197, 398, 0),
(58, '2020-09-03', 22960, 239, 489, 0),
(59, '2020-09-04', 28142, 296, 590, 0),
(60, '2020-09-05', 34395, 363, 720, 0),
(61, '2020-09-06', 41821, 439, 885, 0),
(62, '2020-09-07', 50918, 532, 1074, 0),
(63, '2020-09-08', 61901, 651, 1300, 0),
(64, '2020-09-09', 75323, 795, 1588, 0),
(65, '2020-09-10', 91800, 967, 1923, 0),
(66, '2020-09-11', 111759, 1173, 2366, 0),
(67, '2020-09-12', 136116, 1425, 2836, 0),
(68, '2020-09-13', 165973, 1737, 3483, 0),
(69, '2020-09-14', 202425, 2122, 4274, 0),
(70, '2020-09-15', 246598, 2599, 5175, 0),
(71, '2020-09-16', 300943, 3155, 6295, 0),
(72, '2020-09-17', 367719, 3840, 7733, 0),
(73, '2020-09-18', 448628, 4706, 9467, 0),
(74, '2020-09-19', 459929, 1871, 3690, 0),
(75, '2020-09-20', 468633, 1898, 3807, 0),
(76, '2020-09-21', 475035, 1935, 3831, 0),
(77, '2020-09-22', 479435, 1936, 3917, 0),
(78, '2020-09-23', 480889, 1953, 3893, 0),
(79, '2020-09-24', 479520, 1933, 3884, 0),
(80, '2020-09-25', 475324, 1929, 3855, 0),
(81, '2020-09-26', 467838, 1901, 3794, 0),
(82, '2020-09-27', 458091, 1856, 3731, 0),
(83, '2020-09-28', 446188, 1803, 3598, 0),
(84, '2020-09-29', 433219, 1766, 3503, 0),
(85, '2020-09-30', 419239, 1700, 3398, 0),
(86, '2020-10-01', 405638, 1655, 3297, 0),
(87, '2020-10-02', 393571, 1601, 3209, 0),
(88, '2020-10-03', 385992, 1568, 3137, 0),
(89, '2020-10-04', 377350, 1525, 3033, 0),
(90, '2020-10-05', 368248, 1496, 2991, 0),
(91, '2020-10-06', 359101, 1455, 2923, 0),
(92, '2020-10-07', 350316, 1426, 2836, 0),
(93, '2020-10-08', 341270, 1393, 2734, 0),
(94, '2020-10-09', 332550, 1353, 2729, 0),
(95, '2020-10-10', 324516, 1315, 2620, 0),
(96, '2020-10-11', 316068, 1274, 2565, 0),
(97, '2020-10-12', 308186, 1245, 2500, 0),
(98, '2020-10-13', 301297, 1217, 2447, 0),
(99, '2020-10-14', 293550, 1184, 2364, 0);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
